In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

df = pd.read_csv('titanic.csv')
# df.head(10) shows 10 rows
# df.tail() shows the last rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
float(len(df[df['Embarked'] == 'C']))/len(df['Embarked'].dropna())

0.1889763779527559

In [17]:
float(len(df[(df['Embarked'] == 'C') & (df['Sex'] == 'female')]))/len(df[(df['Sex'] == 'female') & (pd.notnull(df['Embarked']))])

0.23397435897435898

In [12]:
pd.crosstab(df['Sex'], df['Embarked'])

Embarked   C   Q    S
Sex
female    73  36  203
male      95  41  441